[Killed] EqualityOperator
src/inventory/inventory.service.ts:33:18
       status: p.status,
       stock_minimo: p.stock_minimo,
       stock_actual: p.stock_actual,
-      low_stock: p.stock_actual <= p.stock_minimo,
+      low_stock: p.stock_actual > p.stock_minimo,
     };
   }
killedBy: InventoryService getProductDetail sets low_stock true when stock_actual equals stock_minimo (M8 inclusive boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/inventory/inventory.service.ts:33:18
       status: p.status,
       stock_minimo: p.stock_minimo,
       stock_actual: p.stock_actual,
-      low_stock: p.stock_actual <= p.stock_minimo,
+      low_stock: p.stock_actual < p.stock_minimo,
     };
   }
killedBy: InventoryService getProductDetail sets low_stock true when stock_actual equals stock_minimo (M8 inclusive boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
