[Killed] BlockStatement
src/movements/movements.service.ts:23:5
     @InjectDataSource() private readonly dataSource: DataSource,
     @InjectRepository(Movement)
     private readonly movementRepository: Repository<Movement>,
-  ) {
-    this.movementApi = createMovementService({
-      dataSource: this.dataSource,
-      movementRepository: this.movementRepository,
-    });
-  }
+  ) {}
 
   list(query: ListMovementsQuery): Promise<PaginatedMovements> {
killedBy: MovementsService registers IN without stock query
statusReason: TypeError: Cannot read properties of undefined (reading 'registerMovement')
