[Killed] BlockStatement
src/products/products.service.ts:25:5
     private readonly productRepository: Repository<Product>,
     @InjectDataSource()
     private readonly dataSource: DataSource,
-  ) {
-    this.productApi = createProductService({
-      productRepository: this.productRepository,
-      dataSource: this.dataSource,
-    });
-  }
+  ) {}
 
   create(body: CreateProductBody): Promise<Product> {
killedBy: ProductsService persists a valid payload via factory-backed service
statusReason: TypeError: Cannot read properties of undefined (reading 'createProduct')
