[Survived] StringLiteral
movements/services/movement/movement.factory.ts:55:7
     .createQueryBuilder()
     .select(
       `COALESCE(SUM(CASE WHEN m.type = :inType THEN m.quantity ELSE 0 END), 0) - COALESCE(SUM(CASE WHEN m.type = :outType THEN m.quantity ELSE 0 END), 0)`,
-      'stock',
+      "",
     )
     .from(Movement, 'm')

[Survived] StringLiteral
movements/services/movement/movement.factory.ts:57:21
       `COALESCE(SUM(CASE WHEN m.type = :inType THEN m.quantity ELSE 0 END), 0) - COALESCE(SUM(CASE WHEN m.type = :outType THEN m.quantity ELSE 0 END), 0)`,
       'stock',
     )
-    .from(Movement, 'm')
+    .from(Movement, "")
     .where('m.product_id = :productId', { productId })
     .setParameters({

[Survived] StringLiteral
movements/services/movement/movement.factory.ts:58:12
       'stock',
     )
     .from(Movement, 'm')
-    .where('m.product_id = :productId', { productId })
+    .where("", { productId })
     .setParameters({
       inType: MOVEMENT_TYPE.IN,

[Survived] ObjectLiteral
movements/services/movement/movement.factory.ts:58:41
       'stock',
     )
     .from(Movement, 'm')
-    .where('m.product_id = :productId', { productId })
+    .where('m.product_id = :productId', {})
     .setParameters({
       inType: MOVEMENT_TYPE.IN,

[Killed] LogicalOperator
movements/services/movement/movement.factory.ts:65:15
     })
     .getRawOne<{ stock: string | number | null }>();
 
-  const raw = row?.stock ?? 0;
+  const raw = row?.stock && 0;
   const n = Number(raw);
   return Number.isFinite(n) ? n : 0;
killedBy: MovementsService registers OUT when stock is sufficient
statusReason: UnprocessableEntityException: Insufficient stock for this operation.

[Survived] StringLiteral
movements/services/movement/movement.factory.ts:79:37
       });
 
       if (!movement) {
-        throw new NotFoundException(`Movement with id "${id}" not found`);
+        throw new NotFoundException(``);
       }
 

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:84:21
 
       const { product } = movement;
 
-      if (!product) {
-        throw new NotFoundException(`Product for movement "${id}" not found`);
-      }
+      if (!product) {}
 
       return {
killedBy: MovementsService findOne (T-011) throws NotFoundException when movement has no associated product
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundException
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'id')"

      144 |             createdAt: movement.createdAt,

[Killed] StringLiteral
movements/services/movement/movement.factory.ts:113:21
       const qb = deps.movementRepository
         .createQueryBuilder('movement')
         .orderBy('movement.createdAt', 'DESC')
-        .addOrderBy('movement.id', 'DESC');
+        .addOrderBy("", 'DESC');
 
       if (productId) {
killedBy: MovementsService list (T-010) returns empty items with meta.total 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.id", "DESC"
Received: "", "DESC"

Number of calls: 1

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:115:11
         .orderBy('movement.createdAt', 'DESC')
         .addOrderBy('movement.id', 'DESC');
 
-      if (productId) {
+      if (false) {
         qb.andWhere('movement.productId = :productId', { productId });
       }
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.productId = :productId", {"productId": "550e8400-e29b-41d4-a716-446655440001"}
Received
       1
          "movement.type = :type",
          Object {
        -   "productId": "550e8400-e29b-41d4-a716-446655440001",

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:115:22
         .orderBy('movement.createdAt', 'DESC')
         .addOrderBy('movement.id', 'DESC');
 
-      if (productId) {
-        qb.andWhere('movement.productId = :productId', { productId });
-      }
+      if (productId) {}
       if (type) {
         qb.andWhere('movement.type = :type', { type });
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.productId = :productId", {"productId": "550e8400-e29b-41d4-a716-446655440001"}
Received
       1
          "movement.type = :type",
          Object {
        -   "productId": "550e8400-e29b-41d4-a716-446655440001",

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:118:11
       if (productId) {
         qb.andWhere('movement.productId = :productId', { productId });
       }
-      if (type) {
+      if (false) {
         qb.andWhere('movement.type = :type', { type });
       }
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.type = :type", {"type": "IN"}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "type": "IN",

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:118:17
       if (productId) {
         qb.andWhere('movement.productId = :productId', { productId });
       }
-      if (type) {
-        qb.andWhere('movement.type = :type', { type });
-      }
+      if (type) {}
       if (dateFrom) {
         qb.andWhere('movement.date >= :dateFrom', { dateFrom });
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.type = :type", {"type": "IN"}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "type": "IN",

[Killed] ObjectLiteral
movements/services/movement/movement.factory.ts:119:46
         qb.andWhere('movement.productId = :productId', { productId });
       }
       if (type) {
-        qb.andWhere('movement.type = :type', { type });
+        qb.andWhere('movement.type = :type', {});
       }
       if (dateFrom) {
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.type = :type", {"type": "IN"}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "type": "IN",

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:121:11
       if (type) {
         qb.andWhere('movement.type = :type', { type });
       }
-      if (dateFrom) {
+      if (true) {
         qb.andWhere('movement.date >= :dateFrom', { dateFrom });
       }
killedBy: MovementsService list (T-010) returns empty items with meta.total 0
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "movement.date >= :dateFrom", {"dateFrom": undefined}

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:121:21
       if (type) {
         qb.andWhere('movement.type = :type', { type });
       }
-      if (dateFrom) {
-        qb.andWhere('movement.date >= :dateFrom', { dateFrom });
-      }
+      if (dateFrom) {}
       if (dateTo) {
         qb.andWhere('movement.date <= :dateTo', { dateTo });
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date >= :dateFrom", {"dateFrom": 2026-01-01T00:00:00.000Z}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "dateFrom": 2026-01-01T00:00:00.000Z,

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:124:19
       if (dateFrom) {
         qb.andWhere('movement.date >= :dateFrom', { dateFrom });
       }
-      if (dateTo) {
-        qb.andWhere('movement.date <= :dateTo', { dateTo });
-      }
+      if (dateTo) {}
 
       const skip = (page - 1) * pageSize;
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date <= :dateTo", {"dateTo": 2026-01-31T00:00:00.000Z}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "dateTo": 2026-01-31T00:00:00.000Z,

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:124:11
       if (dateFrom) {
         qb.andWhere('movement.date >= :dateFrom', { dateFrom });
       }
-      if (dateTo) {
+      if (false) {
         qb.andWhere('movement.date <= :dateTo', { dateTo });
       }
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date <= :dateTo", {"dateTo": 2026-01-31T00:00:00.000Z}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "dateTo": 2026-01-31T00:00:00.000Z,

[Killed] StringLiteral
movements/services/movement/movement.factory.ts:125:21
         qb.andWhere('movement.date >= :dateFrom', { dateFrom });
       }
       if (dateTo) {
-        qb.andWhere('movement.date <= :dateTo', { dateTo });
+        qb.andWhere("", { dateTo });
       }
 
killedBy: MovementsService list (T-010) adds filters when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "movement.date <= :dateTo", {"dateTo": 2026-01-31T00:00:00.000Z}
Received
       1
          "movement.productId = :productId",
          Object {
        -   "dateTo": 2026-01-31T00:00:00.000Z,

[Killed] ArithmeticOperator
movements/services/movement/movement.factory.ts:128:21
         qb.andWhere('movement.date <= :dateTo', { dateTo });
       }
 
-      const skip = (page - 1) * pageSize;
+      const skip = (page + 1) * pageSize;
       qb.skip(skip).take(pageSize);
 
killedBy: MovementsService list (T-010) returns empty items with meta.total 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 0
Received: 40

Number of calls: 1

[Killed] ArithmeticOperator
movements/services/movement/movement.factory.ts:128:20
         qb.andWhere('movement.date <= :dateTo', { dateTo });
       }
 
-      const skip = (page - 1) * pageSize;
+      const skip = (page - 1) / pageSize;
       qb.skip(skip).take(pageSize);
 
killedBy: MovementsService list (T-010) applies skip/take for page 2
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10
Received: 0.1

Number of calls: 1

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:132:26
       qb.skip(skip).take(pageSize);
 
       const [items, total] = await qb.getManyAndCount();
-      const totalPages = total === 0 ? 0 : Math.ceil(total / pageSize);
+      const totalPages = true ? 0 : Math.ceil(total / pageSize);
 
       return {
killedBy: MovementsService list (T-010) M6: returns exact items and correct totalPages when results exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
movements/services/movement/movement.factory.ts:132:54
       qb.skip(skip).take(pageSize);
 
       const [items, total] = await qb.getManyAndCount();
-      const totalPages = total === 0 ? 0 : Math.ceil(total / pageSize);
+      const totalPages = total === 0 ? 0 : Math.ceil(total * pageSize);
 
       return {
killedBy: MovementsService list (T-010) M6: returns exact items and correct totalPages when results exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 40

[Killed] ObjectLiteral
movements/services/movement/movement.factory.ts:143:18
     async registerMovement(payload: CreateMovementBody): Promise<Movement> {
       return deps.dataSource.transaction(async (manager) => {
         const product = await manager.findOne(Product, {
-          where: { id: payload.productId },
+          where: {},
           lock: { mode: 'pessimistic_write' },
         });
killedBy: MovementsService M4/M5: persists exact type and quantity for IN movement
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function Product],
  Object {
    "lock": Object {

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:153:13
           );
         }
 
-        if (product.status === PRODUCT_STATUS.INACTIVO) {
+        if (true) {
           throw new UnprocessableEntityException(
             'Cannot register movement for an inactive product.',
killedBy: MovementsService registers IN without stock query
statusReason: UnprocessableEntityException: Cannot register movement for an inactive product.

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:153:57
           );
         }
 
-        if (product.status === PRODUCT_STATUS.INACTIVO) {
-          throw new UnprocessableEntityException(
-            'Cannot register movement for an inactive product.',
-          );
-        }
+        if (product.status === PRODUCT_STATUS.INACTIVO) {}
 
         if (payload.type === MOVEMENT_TYPE.OUT) {
killedBy: MovementsService INACTIVO message: throws with exact error text for inactive product
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
movements/services/movement/movement.factory.ts:159:13
           );
         }
 
-        if (payload.type === MOVEMENT_TYPE.OUT) {
+        if (payload.type !== MOVEMENT_TYPE.OUT) {
           const currentStock = await getCurrentStock(
             manager,
killedBy: MovementsService registers IN without stock query
statusReason: UnprocessableEntityException: Insufficient stock for this operation.

[Killed] BlockStatement
movements/services/movement/movement.factory.ts:159:49
           );
         }
 
-        if (payload.type === MOVEMENT_TYPE.OUT) {
-          const currentStock = await getCurrentStock(
-            manager,
-            payload.productId,
-          );
-          if (payload.quantity > currentStock) {
-            throw new UnprocessableEntityException(
-              'Insufficient stock for this operation.',
-            );
-          }
-        }
+        if (payload.type === MOVEMENT_TYPE.OUT) {}
 
         const movement = manager.create(Movement, {
killedBy: MovementsService registers OUT when stock is sufficient
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
movements/services/movement/movement.factory.ts:164:15
             manager,
             payload.productId,
           );
-          if (payload.quantity > currentStock) {
+          if (payload.quantity <= currentStock) {
             throw new UnprocessableEntityException(
               'Insufficient stock for this operation.',
killedBy: MovementsService registers OUT when stock is sufficient
statusReason: UnprocessableEntityException: Insufficient stock for this operation.

[Killed] ConditionalExpression
movements/services/movement/movement.factory.ts:164:15
             manager,
             payload.productId,
           );
-          if (payload.quantity > currentStock) {
+          if (true) {
             throw new UnprocessableEntityException(
               'Insufficient stock for this operation.',
killedBy: MovementsService registers OUT when stock is sufficient
statusReason: UnprocessableEntityException: Insufficient stock for this operation.
