[Killed] EqualityOperator
products/services/product/product.factory.ts:39:7
 function parseAggregateNumber(
   value: string | number | null | undefined,
 ): number {
-  if (value == null) {
+  if (value != null) {
     return 0;
   }
killedBy: ProductsService findAll (T-004) maps stock_actual from aggregated raw column
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 23
Received: 0

[Killed] ConditionalExpression
products/services/product/product.factory.ts:39:7
 function parseAggregateNumber(
   value: string | number | null | undefined,
 ): number {
-  if (value == null) {
+  if (true) {
     return 0;
   }
killedBy: ProductsService findAll (T-004) maps stock_actual from aggregated raw column
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 23
Received: 0

[Survived] StringLiteral
products/services/product/product.factory.ts:73:11
         .createQueryBuilder('product')
         .leftJoin(
           `(${balanceSubQuery})`,
-          'stock_agg',
+          "",
           'stock_agg.product_id = product.id',
         )

[Survived] StringLiteral
products/services/product/product.factory.ts:74:11
         .leftJoin(
           `(${balanceSubQuery})`,
           'stock_agg',
-          'stock_agg.product_id = product.id',
+          "",
         )
         .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')

[Survived] StringLiteral
products/services/product/product.factory.ts:77:18
           'stock_agg.product_id = product.id',
         )
         .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')
-        .orderBy('product.name', 'ASC')
+        .orderBy("", 'ASC')
         .setParameters(STOCK_MOVEMENT_QUERY_PARAMS)
         .getRawAndEntities();

[Killed] ConditionalExpression
products/services/product/product.factory.ts:124:22
           name: product.name,
           stock_actual,
           stock_minimo: product.stock_minimo,
-          low_stock: stock_actual <= product.stock_minimo,
+          low_stock: true,
         };
       });
killedBy: ProductsService findInventoryPositions (T-012) maps stock_actual like GET /products and sets low_stock with M8 inclusive boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
      "stock_actual": 10,
      "stock_minimo": 10,

[Killed] EqualityOperator
products/services/product/product.factory.ts:124:22
           name: product.name,
           stock_actual,
           stock_minimo: product.stock_minimo,
-          low_stock: stock_actual <= product.stock_minimo,
+          low_stock: stock_actual < product.stock_minimo,
         };
       });
killedBy: ProductsService findInventoryPositions (T-012) maps stock_actual like GET /products and sets low_stock with M8 inclusive boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Survived] StringLiteral
products/services/product/product.factory.ts:144:54
           'stock_agg',
           'stock_agg.product_id = product.id',
         )
-        .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')
+        .addSelect('COALESCE(stock_agg.balance, 0)', "")
         .where('product.id = :id', { id: productId })
         .setParameters(STOCK_MOVEMENT_QUERY_PARAMS)

[Survived] StringLiteral
products/services/product/product.factory.ts:144:20
           'stock_agg',
           'stock_agg.product_id = product.id',
         )
-        .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')
+        .addSelect("", 'stock_actual')
         .where('product.id = :id', { id: productId })
         .setParameters(STOCK_MOVEMENT_QUERY_PARAMS)

[Killed] ConditionalExpression
products/services/product/product.factory.ts:150:11
         .getRawAndEntities();
 
       const product = entities[0];
-      if (!product) {
+      if (true) {
         throw new NotFoundException(`Product with id "${productId}" not found`);
       }
killedBy: ProductsService findOne (T-008) returns product with stock_actual from single aggregated query
statusReason: NotFoundException: Product with id "550e8400-e29b-41d4-a716-446655440011" not found

[Killed] ConditionalExpression
products/services/product/product.factory.ts:150:11
         .getRawAndEntities();
 
       const product = entities[0];
-      if (!product) {
+      if (false) {
         throw new NotFoundException(`Product with id "${productId}" not found`);
       }
killedBy: ProductsService findOne (T-008) throws NotFoundException when product does not exist
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"stock_actual": 0}

[Killed] ObjectLiteral
products/services/product/product.factory.ts:169:9
       payload: UpdateProductBody,
     ): Promise<ProductWithStockActual> {
       const result = await deps.productRepository.update(
-        { id: productId },
+        {},
         payload,
       );
killedBy: ProductsService update / patch (T-009) applies partial fields and returns product with stock_actual
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": "550e8400-e29b-41d4-a716-446655440077",
- }

[Killed] ConditionalExpression
products/services/product/product.factory.ts:172:11
         { id: productId },
         payload,
       );
-      if (result.affected === 0) {
+      if (false) {
         throw new NotFoundException(`Product with id "${productId}" not found`);
       }
killedBy: ProductsService update / patch (T-009) throws NotFoundException when product does not exist
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"category": "c", "createdAt": 2026-05-13T00:22:17.947Z, "description": "d", "id": "550e8400-e29b-41d4-a716-446655440077", "name": "New", "status": "ACTIVO", "stock_actual": 3, "stock_minimo": 5, "unit": "KG", "updatedAt": 2026-05-13T00:22:17.947Z}

[Killed] ConditionalExpression
products/services/product/product.factory.ts:172:11
         { id: productId },
         payload,
       );
-      if (result.affected === 0) {
+      if (true) {
         throw new NotFoundException(`Product with id "${productId}" not found`);
       }
killedBy: ProductsService update / patch (T-009) applies partial fields and returns product with stock_actual
statusReason: NotFoundException: Product with id "550e8400-e29b-41d4-a716-446655440077" not found

[Survived] StringLiteral
products/services/product/product.factory.ts:189:11
       const { entities, raw } = await deps.productRepository
         .createQueryBuilder('product')
         .leftJoin(
-          `(${balanceSubQuery})`,
+          ``,
           'stock_agg',
           'stock_agg.product_id = product.id',

[Survived] StringLiteral
products/services/product/product.factory.ts:195:18
         )
         .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')
         .where('COALESCE(stock_agg.balance, 0) <= product.stock_minimo')
-        .orderBy('product.name', 'ASC')
+        .orderBy("", 'ASC')
         .setParameters(STOCK_MOVEMENT_QUERY_PARAMS)
         .getRawAndEntities();

[Killed] BlockStatement
products/services/product/product.factory.ts:217:60
      * Check + delete run inside one DB transaction.
      */
     async deleteProduct(productId: string): Promise<void> {
-      await deps.dataSource.transaction(async (manager) => {
-        const product = await manager.findOne(Product, {
-          where: { id: productId },
-          lock: { mode: 'pessimistic_write' },
-        });
-
-        if (!product) {
-          throw new NotFoundException(
-            `Product with id "${productId}" not found`,
-          );
-        }
-
-        const movementCount = await manager.count(Movement, {
-          where: { productId },
-        });
-
-        if (movementCount > 0) {
-          throw new ConflictException(
-            'Cannot delete product: associated movements found.',
-          );
-        }
-
-        await manager.delete(Product, { id: productId });
-      });
+      await deps.dataSource.transaction(async (manager) => {});
     },
   };
killedBy: ProductsService delete (T-002) deletes when product exists and has no movements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Function Product], {"lock": {"mode": "pessimistic_write"}, "where": {"id": "550e8400-e29b-41d4-a716-446655440000"}}

Number of calls: 0

[Killed] ObjectLiteral
products/services/product/product.factory.ts:218:56
      */
     async deleteProduct(productId: string): Promise<void> {
       await deps.dataSource.transaction(async (manager) => {
-        const product = await manager.findOne(Product, {
-          where: { id: productId },
-          lock: { mode: 'pessimistic_write' },
-        });
+        const product = await manager.findOne(Product, {});
 
         if (!product) {
killedBy: ProductsService delete (T-002) deletes when product exists and has no movements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function Product],
- Object {
-   "lock": Object {

[Survived] StringLiteral
products/services/product/product.factory.ts:225:13
 
         if (!product) {
           throw new NotFoundException(
-            `Product with id "${productId}" not found`,
+            ``,
           );
         }

[Killed] ObjectLiteral
products/services/product/product.factory.ts:229:61
           );
         }
 
-        const movementCount = await manager.count(Movement, {
-          where: { productId },
-        });
+        const movementCount = await manager.count(Movement, {});
 
         if (movementCount > 0) {
killedBy: ProductsService delete (T-002) deletes when product exists and has no movements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function Movement],
- Object {
-   "where": Object {

[Killed] ConditionalExpression
products/services/product/product.factory.ts:233:13
           where: { productId },
         });
 
-        if (movementCount > 0) {
+        if (true) {
           throw new ConflictException(
             'Cannot delete product: associated movements found.',
killedBy: ProductsService delete (T-002) deletes when product exists and has no movements
statusReason: ConflictException: Cannot delete product: associated movements found.

[Killed] BlockStatement
products/services/product/product.factory.ts:233:32
           where: { productId },
         });
 
-        if (movementCount > 0) {
-          throw new ConflictException(
-            'Cannot delete product: associated movements found.',
-          );
-        }
+        if (movementCount > 0) {}
 
         await manager.delete(Product, { id: productId });
killedBy: ProductsService delete (T-002) throws ConflictException when movements exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ConflictException
Received constructor: ReferenceError
