[Killed] ArithmeticOperator
movements/services/movement/movement.factory.ts:132:36
       qb.skip(skip).take(pageSize);
 
       const [items, total] = await qb.getManyAndCount();
-      const totalPages = Math.ceil(total / pageSize);
+      const totalPages = Math.ceil(total * pageSize);
 
       return {
killedBy: MovementsService list (T-010) M6: returns exact items and correct totalPages when results exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 40
