[Killed] ConditionalExpression
products/services/product/product.factory.ts:121:22
           name: product.name,
           stock_actual,
           stock_minimo: product.stock_minimo,
-          low_stock: stock_actual <= product.stock_minimo,
+          low_stock: false,
         };
       });
killedBy: ProductsService findInventoryPositions (T-012) maps stock_actual like GET /products and sets low_stock with M8 inclusive boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] EqualityOperator
products/services/product/product.factory.ts:121:22
           name: product.name,
           stock_actual,
           stock_minimo: product.stock_minimo,
-          low_stock: stock_actual <= product.stock_minimo,
+          low_stock: stock_actual > product.stock_minimo,
         };
       });
killedBy: ProductsService findInventoryPositions (T-012) maps stock_actual like GET /products and sets low_stock with M8 inclusive boundary
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Object {
      "id": "550e8400-e29b-41d4-a716-446655440030",

[Killed] BlockStatement
products/services/product/product.factory.ts:147:21
         .getRawAndEntities();
 
       const product = entities[0];
-      if (!product) {
-        throw new NotFoundException(`Product with id "${productId}" not found`);
-      }
+      if (!product) {}
 
       const row = raw[0] as Record<string, unknown> | undefined;
killedBy: ProductsService findOne (T-008) throws NotFoundException when product does not exist
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"stock_actual": 0}

[Killed] StringLiteral
products/services/product/product.factory.ts:148:37
 
       const product = entities[0];
       if (!product) {
-        throw new NotFoundException(`Product with id "${productId}" not found`);
+        throw new NotFoundException(``);
       }
 
killedBy: ProductsService findOne (T-008) throws NotFoundException when product does not exist
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Product with id \"550e8400-e29b-41d4-a716-446655440011\" not found",
+   "message": "Not Found",

[Killed] EqualityOperator
products/services/product/product.factory.ts:169:11
         { id: productId },
         payload,
       );
-      if (result.affected === 0) {
+      if (result.affected !== 0) {
         throw new NotFoundException(`Product with id "${productId}" not found`);
       }
killedBy: ProductsService update / patch (T-009) applies partial fields and returns product with stock_actual
statusReason: NotFoundException: Product with id "550e8400-e29b-41d4-a716-446655440077" not found

[Killed] StringLiteral
products/services/product/product.factory.ts:191:16
           'stock_agg.product_id = product.id',
         )
         .addSelect('COALESCE(stock_agg.balance, 0)', 'stock_actual')
-        .where('COALESCE(stock_agg.balance, 0) <= product.stock_minimo')
+        .where("")
         .orderBy('product.name', 'ASC')
         .setParameters(STOCK_MOVEMENT_QUERY_PARAMS)
killedBy: ProductsService findInventoryAlerts (T-005) returns slim rows with db-side M8 filter applied
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "COALESCE(stock_agg.balance, 0) <= product.stock_minimo"
Received: ""

Number of calls: 1

[Killed] ObjectLiteral
products/services/product/product.factory.ts:216:18
     async deleteProduct(productId: string): Promise<void> {
       await deps.dataSource.transaction(async (manager) => {
         const product = await manager.findOne(Product, {
-          where: { id: productId },
+          where: {},
           lock: { mode: 'pessimistic_write' },
         });
killedBy: ProductsService delete (T-002) deletes when product exists and has no movements
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  [Function Product],
  Object {
    "lock": Object {

[Killed] ConditionalExpression
products/services/product/product.factory.ts:230:13
           where: { productId },
         });
 
-        if (movementCount > 0) {
+        if (false) {
           throw new ConflictException(
             'Cannot delete product: associated movements found.',
killedBy: ProductsService delete (T-002) throws ConflictException when movements exist
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ConflictException
Received constructor: ReferenceError

[Killed] StringLiteral
products/services/product/product.factory.ts:232:13
 
         if (movementCount > 0) {
           throw new ConflictException(
-            'Cannot delete product: associated movements found.',
+            "",
           );
         }
killedBy: ProductsService delete (T-002) throws ConflictException when movements exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Cannot delete product: associated movements found."
Received: "Conflict"
